app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE (price > 5000) AND (price < 80000)
---
  def index
    @vehicles = VehicleQuery.new(Vehicle.all).call(vehicle_query_params)

INSERT INTO "vehicles" ("name", "colour", "price", "make", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Alto"], ["colour", "Black"], ["price", 20000], ["make", "1998"], ["created_at", "2020-07-27 18:51:10.607124"], ["updated_at", "2020-07-27 18:51:10.607124"]]
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 2]]
---
  def destroy
    @vehicle.destroy

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_vehicle
    @vehicle = Vehicle.find(params[:id])